#ifndef TOWER_HPP_
#define TOWER_HPP_

#pragma once

namespace Entities {
  class Tower {
    // Поля класса:
    // уровень, урон, скорость, радиус атаки, стоимость

    // Методы класса (изменение):
    // add_lvl() - добавление 1 к уровню
    // set_damage() - изменение урона
    // set_speed() - изменение скорострельности
    // set_radius() - изменение радиуса
    // set_money() - изменение стоимости (для улучшений)

    // Методы класса (вывод):
    // lvl() - получение уровня
    // money() - получение стоимости
    // damage() - получение урона
    // radius() - получение радиуса
  };
}

#endif // TOWER_HPP_
